### port_lite database: stocks tables
### portmy database: profits, stocks tables
### portpg database: consensus, tickers tables
### csv files: consensus-ORD.csv

In [1]:
import pandas as pd
import numpy as np
import os

from datetime import date, timedelta
from sqlalchemy import create_engine
from pandas.tseries.offsets import BDay

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine("postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development")
conpg = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

# Define a formatting function to format integers with zero decimal places and floats with two decimal places
def format_cell(x):
    if isinstance(x, int):
        return "{:,.0f}".format(x)
    elif isinstance(x, float):
        return "{:.2f}".format(x)
    else:
        return x

#pd.options.display.float_format = '{:.2f}'.format

today = date.today()
today

datetime.date(2023, 10, 15)

In [2]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
print(f'yesterday: {yesterday}')

today: 2023-10-15
yesterday: 2023-10-12 00:00:00

In [3]:
# find the beginning of the week for the given yesterday
week_start = yesterday.to_period('W').start_time
week_end = yesterday.to_period('W').end_time
week_start = week_start.date()
week_end = week_end.date()
print(f'week start: {week_start}')
print(f'week end: {week_end}')

week start: 2023-10-09
week end: 2023-10-15

In [4]:
yesterday = yesterday.date()
week_start, yesterday

(datetime.date(2023, 10, 9), datetime.date(2023, 10, 12))

### Restart and Run All Cells

In [5]:
cols = 'quarter price target_price upside buy hold sell yield max_price min_price pe pbv dly_vol beta'.split()
colt = 'name price target_price upside buy hold sell market sector subsector dly_vol beta yield'.split()
colu = 'price target_price upside buy hold sell mrkt yield'.split()

format_dict = {
    'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',   
    'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',    
    'q_amt_c':'{:,}','y_amt': '{:,}','inc_amt_py':'{:,}', 
    'q_amt_p': '{:,}','inc_amt_pq':'{:,}', 
    'inc_pct_y': '{:.2f}%','inc_pct_q': '{:.2f}%',
    'inc_pct_py': '{:.2f}%','inc_pct_pq': '{:.2f}%',
    'mean_pct': '{:.2f}%','std_pct': '{:.2f}%','upside': '{:.2f}%', 
    
    'price':'{:.2f}','target_price':'{:.2f}','diff':'{:.2f}',
    'eps_a':'{:.2f}','eps_b':'{:.2f}',                
    'pe':'{:.2f}','pbv':'{:.2f}',
    'yield':'{:.2f}%',
    
    'price':'{:.2f}','max_price':'{:.2f}','min_price':'{:.2f}',   
    'target':'{:.2f}','max':'{:.2f}','min':'{:.2f}',
    'pe':'{:.2f}','pbv':'{:.2f}',
    'paid_up':'{:,.2f}','market_cap':'{:,.2f}',   
    'daily_volume':'{:,.2f}','beta':'{:,.2f}', 
    'dly_vol':'{:,.2f}',    
}

In [6]:
pd.options.display.max_rows = 40
sql = '''
SELECT *
FROM profits
LIMIT 1'''
my_profit = pd.read_sql(sql, conmy)
my_profit.dtypes

id                  int64
name               object
year                int64
quarter             int64
kind                int64
latest_amt_y        int64
previous_amt_y      int64
inc_amt_y           int64
inc_pct_y         float64
latest_amt_q        int64
previous_amt_q      int64
inc_amt_q           int64
inc_pct_q         float64
q_amt_c             int64
y_amt               int64
inc_amt_py          int64
inc_pct_py        float64
q_amt_p             int64
inc_amt_pq          int64
inc_pct_pq        float64
ticker_id           int64
mean_pct          float64
std_pct           float64
dtype: object

In [7]:
sql = '''
SELECT *
FROM stocks
LIMIT 1'''
lite_stock = pd.read_sql(sql, conlite)
lite_stock.dtypes

id                 int64
name              object
max_price        float64
min_price        float64
status            object
buy_target       float64
sell_target      float64
volume           float64
beta             float64
cost             float64
qty                int64
buy_spread         int64
sell_spread        int64
available_qty      int64
bl               float64
sh               float64
reason            object
market            object
dtype: object

In [8]:
sql = '''
SELECT *
FROM tickers
LIMIT 1'''
my_ticker = pd.read_sql(sql, conpg)
my_ticker.dtypes

id                     int64
name                  object
full_name             object
sector                object
subsector             object
market                object
website               object
created_at    datetime64[ns]
updated_at    datetime64[ns]
dtype: object

In [9]:
sql = '''
SELECT P.name, market
FROM profits P
JOIN tickers T
ON P.ticker_id = T.id 
ORDER BY P.name'''
my_profits = pd.read_sql(sql, conmy)
my_profits

      name                             market
0   AIMIRT                                SET
1      BBL            SET50 / SETHD / SETTHSI
2      BEM            SET50 / SETTHSI / SETWB
3       BH            SET50 / SETCLMV / SETWB
4       CK         SET100 / SETCLMV / SETTHSI
5      CPN                    SET50 / SETTHSI
6    DELTA                                SET
7     HANA                   SET100 / SETTHSI
8     ICHI                     sSET / SETCLMV
9      III                               sSET
10     JMT                              SET50
11     KTB            SET50 / SETHD / SETTHSI
12       M                              SETWB
13     PSH                            SETTHSI
14   PTTEP  SET50 / SETCLMV / SETHD / SETTHSI
15      QH                     SET100 / SETHD
16   SAPPE                               sSET
17      SC                     sSET / SETTHSI
18    SIRI                      SET / SETTHSI
19     TOA                            SETTHSI
20     TTB            SET50 / SETHD / SETTHSI

### ruby ruby\crt-consensus-new.rb

In [10]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Weekly'

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [12]:
!ruby ruby\\crt-consensus-new.rb

Start at: Sunday, Oct 15 09:44 PM
Name,Target,Max,Min,Buy,Hold,Sell
ACE        3.68   3.76   3.60  1  1  0   1
ADVANC   250.50 265.00 230.00 13  2  0   2
AEONTS   183.00 226.00 165.00  4  6  0   3
AH        46.01  54.10  41.00  9  0  0   4
AIMIRT    14.50  14.50  14.50  1  0  0   5
AJ        10.00  10.00  10.00  1  0  0   6
AMATA     28.42  30.00  25.80 15  1  0   7
ANAN       0.74   0.80   0.62  0  1  0   8
AOT       82.71  92.00  72.00 12  1  0   9
AP        14.76  16.00  14.00 15  0  0  10
ASIAN      9.32  11.20   7.59  3  1  0  11
ASK       29.53  34.50  23.60  3  1  0  12
ASP        3.00   3.00   3.00  0  0  0  13
ASW       10.08  11.00   8.95  2  1  0  14
AWC        5.90   6.80   5.30  3  3  0  15
BA        20.42  22.00  19.50  7  0  0  16
BAM       13.32  16.00  10.00  7  3  0  17
BANPU      9.03  10.50   7.00  2  4  3  18
BAY       36.38  38.00  32.50  3  1  0  19
BBL      193.51 220.00 164.00 19  1  0  20
BCH       20.93  23.70  15.70 11  3  2  21
BCP       44.98  52.50  37.00 14  4  0  22
BCPG      14.13  18.00  11.00  8  1  0  23
BDMS      54.88 310.00  32.00 14  0  0  24
BE8       58.31  74.00  49.00  4  0  0  25
BEAUTY     0.50   0.50   0.50  0  0  0  26
BEC        8.03   9.00   6.00  3  4  2  27
BEM       10.94  12.40   9.50 15  0  0  28
BGC        9.88  10.30   9.45  1  1  0  29
BGRIM     43.04  50.00  26.75 15  4  0  30
BH       284.48 310.00 246.00 13  2  0  31
BJC       42.00  45.00  30.00 12  1  1  32
BLA       36.50  40.00  33.00  2  0  0  33
BLAND      1.10   1.10   1.10  1  0  0  34
BPP       17.56  20.00  15.50  3  2  0  35
BTS        8.96  11.20   7.50  6  3  0  36
BTSGIF     5.22   6.45   4.15  4  1  0  37
CBG       86.74 109.00  60.00  8  5  1  38
CENTEL    52.60  59.00  47.15  6  6  0  39
CHG        3.51   4.00   2.55  6  5  1  40
CK        26.89  30.25  25.00 12  0  0  41
CKP        4.57   6.20   3.16  4  3  1  42
COM7      37.79  41.00  35.00 13  0  0  43
COTTO      2.24   2.24   2.24  0  0  0  44
CPALL     75.35  80.00  70.00 19  1  0  45
CPAXT     38.02  43.00  29.00 10  1  1  46
CPF       22.24  25.60  17.30  9  8  1  47
CPN       81.04  84.00  78.00 12  0  0  48
CPNREIT   11.28  13.00  10.00  2  2  0  49
CPTGF      6.20   6.20   6.20  1  0  0  50
CRC       49.87  54.00  46.00 12  1  0  51
DCC        2.24   2.55   2.06  0  0  0  52
DELTA     73.97 100.00  55.55  2  0  0  53
DIF       13.30  19.00  10.50  4  1  0  54
DOHOME    12.48  19.40   8.00  8  4  0  55
DRT        8.32   8.50   8.05  1  2  0  56
EA        71.64  84.00  46.00  5  4  0  57
EASTW      8.00   8.00   8.00  1  0  0  58
EGCO     171.14 249.00 120.00  3  3  1  59
EPG        8.72  10.30   7.20  3  2  0  60
ESSO      11.70  15.00   8.30  4  0  0  61
FPT       16.50  16.50  16.50  1  0  0  62
FTREIT    12.00  12.00  12.00  1  0  0  63
GFPT      14.01  16.20  12.00 10  4  0  64
GGC       10.68  12.20  10.00  0  1  0  65
GLOBAL    18.51  22.00  17.00  7  6  0  66
GPSC      69.62  80.00  52.00 15  4  0  67
GULF      58.52  68.00  45.00 13  2  0  68
GUNKUL     4.93   6.20   4.30  5  0  0  69
GVREIT     6.60   6.60   6.60  0  0  0  70
HANA      63.55  80.00  47.60  8  3  1  71
HMPRO     16.64  18.50  13.78 16  2  0  72
HTC       45.50  48.00  41.50  2  1  0  73
ICHI      19.07  21.50  17.00  6  0  0  74
III       15.12  18.10  12.00  5  1  0  75
ILM       25.13  30.00  22.10  4  2  0  76
IMH       13.55  13.55  13.55  1  0  0  77
IMPACT    15.60  16.50  14.70  2  0  0  78
INTUCH    86.08 100.00  68.00  5  0  0  79
IP        16.33  17.00  16.00  2  1  0  80
IRPC       2.51   3.00   1.80  4  8  2  81
IVL       35.86  44.00  28.00 13  3  1  82
JASIF      7.19   8.30   6.00  1  4  0  83
JMART     24.88  25.75  24.00  1  1  0  84
JMT       55.56  70.00  46.00  9  0  0  85
KBANK    149.78 168.00 133.00 10  7  0  86
KCE       53.16  64.00  42.00 13  4  0  87
KEX        8.76  10.80   7.50  0  1  0  88
KKP       64.00  78.00  55.00  5  9  2  89
KSL        3.43   3.90   2.95  1  1  0  90
KTB       22.79  25.00  19.40 16  2  0  91
KTC       56.56  75.00  42.00  7  0  0  92
LALIN      6.34   7.17   5.50  0  1  0  93
LANNA     14.90  14.90  14.90  0  0  0  94
LH        10.06  11.10   8.80  9  4  0  95
LPF       15.00  15.00  15.00  1  0  0  96
LPN        3.69   4.30   3.00  0  1  0  97
M         55.31  61.00  52.00  6  2  0  98
MAJOR     19.63  23.20  17.50  9  1  0  99
MC        15.24  16.45  14.00  8  0  0 100
MCS        8.30   8.30   8.30  0  0  0 101
MEGA      52.44  65.00  47.00  9  0  0 102
MINT      42.11  46.00  38.00 14  0  0 103
MST       10.00  10.00  10.00  0  0  0 104
MTC       38.24  49.00  31.00  6  6  6 105
NER        5.65   6.20   5.30  6  0  0 106
NOBLE      5.31   5.91   4.70  1  1  0 107
ONEE       6.07   6.40   5.55  7  1  0 108
OR        24.36  29.50  17.50 10  5  2 109
ORI       13.20  14.40  12.50 10  0  0 110
OSP       32.83  35.00  29.00  9  3  0 111
PLANB     10.02  11.00   8.32 11  1  0 112
PRM        9.00  11.10   8.00  6  0  0 113
PSH       11.24  15.40   8.00  2  2  5 114
PSL       11.75  13.00  10.30  3  1  0 115
PTG       12.05  14.00  10.20  5  6  0 116
PTT       39.20  47.50  30.00 11  4  1 117
PTTEP    183.24 200.00 167.00 18  5  0 118
PTTGC     41.92  52.00  34.00  4 11  1 119
QH         2.51   2.90   2.00  4  6  0 120
RATCH     44.32  54.50  35.50  7  4  0 121
RBF       12.83  14.50  11.20  6  1  0 122
RCL       18.00  18.00  18.00  0  0  0 123
RJH       32.00  33.00  31.00  0  0  0 124
ROJNA      8.04   8.70   7.36  3  1  0 125
RS        16.03  17.90  14.00  3  2  1 126
SAPPE    105.10 120.00  85.50  8  4  0 127
SAT       21.85  23.70  19.10  7  4  1 128
SAWAD     53.97  64.00  42.00  9  4  2 129
SC         5.09   5.30   4.80  9  0  0 130
SCB      129.12 145.00 106.50 16  1  0 131
SCC      348.07 410.00 310.00  7  6  1 132
SCCC     149.60 160.00 139.00  1  4  0 133
SCGP      45.03  59.00  32.00 12  2  2 134
SENA       2.27   2.27   2.27  0  0  0 135
SINGER     6.00   6.00   6.00  0  0  0 136
SIRI       2.22   2.32   2.00  8  2  0 137
SIS       29.27  30.53  28.00  2  0  0 138
SJWD      19.78  21.50  16.70  6  0  0 139
SKR       16.40  16.40  16.40  1  0  0 140
SMPC      12.10  12.10  12.10  1  0  0 141
SNC        9.20   9.90   8.50  0  0  0 142
SPALI     25.33  27.80  21.70 13  3  0 143
SPCG      15.80  15.80  15.80  0  0  0 144
SPRC      10.64  12.50   9.00 12  5  0 145
SSP       10.28  14.00   8.00  3  1  1 146
STA       17.12  20.90  13.00  3  2  0 147
STANLY   237.43 245.00 216.00  5  1  0 148
STEC      12.28  15.03  10.20  6  5  0 149
STGT       7.50   7.50   7.50  0  0  0 150
SVI        8.65   9.64   8.00  1  4  0 151
SYNEX     14.71  17.86  10.20  5  2  0 152
TASCO     20.22  22.25  16.00  3  5  0 153
TCAP      57.64  65.60  50.00  5  3  0 154
TFFIF      9.55   9.60   9.50  2  0  0 155
TFG        4.44   5.20   3.70  2  3  0 156
THANI      3.40   3.90   2.80  3  2  1 157
THG       51.25  56.00  47.00  0  0  0 158
TIDLOR    28.15  34.25  24.00 14  1  0 159
TISCO    110.45 124.00 103.00 10  4  0 160
TKN       15.00  15.00  15.00  1  0  0 161
TKS        8.95   8.95   8.95  0  0  0 162
TMT        7.40   8.50   6.30  1  0  0 163
TOA       38.75  40.00  35.00  4  0  0 164
TOP       63.11  78.00  52.00 19  3  0 165
TPIPL      2.21   2.44   2.00  2  1  0 166
TPIPP      4.12   4.55   3.80  1  2  0 167
TQM       39.25  45.00  28.00  3  1  0 168
TRUE       8.73  10.00   7.23  8  3  0 169
TTA        7.80   8.60   7.00  1  1  0 170
TTB        1.78   2.00   1.52  9  8  0 171
TTW        8.60   9.20   8.00  0  1  0 172
TU        16.62  19.40  13.00 18  3  0 173
TVO       23.60  26.60  20.50  0  4  0 174
VGI        3.02   3.71   1.90  5  4  1 175
WHA        5.56   6.30   4.00  9  3  0 176
WHAIR      8.33   8.60   8.10  2  1  0 177
WHART     12.95  13.40  12.50  2  0  0 178
WHAUP      5.02   5.50   4.45  3  0  0 179
WICE       8.36   9.60   7.00  2  1  1 180
WORK      16.60  16.70  16.50  1  1  0 181
End at: Sunday, Oct 15 09:53 PM

In [13]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Weekly")
%pwd

'C:\\users\\user\\onedrive\\a7\\Weekly'

In [14]:
data_path = "../data/"
file_name   = 'consensus-new.csv'
input_file = data_path + file_name
consensus = pd.read_csv(input_file, sep=',', index_col=None)
consensus = consensus.rename(columns=str.lower)
consensus

       name  target     max     min  buy  hold  sell
0       ACE    3.68    3.76    3.60    1     1     0
1    ADVANC  250.50  265.00  230.00   13     2     0
2    AEONTS  183.00  226.00  165.00    4     6     0
3        AH   46.01   54.10   41.00    9     0     0
4    AIMIRT   14.50   14.50   14.50    1     0     0
..      ...     ...     ...     ...  ...   ...   ...
176   WHAIR    8.33    8.60    8.10    2     1     0
177   WHART   12.95   13.40   12.50    2     0     0
178   WHAUP    5.02    5.50    4.45    3     0     0
179    WICE    8.36    9.60    7.00    2     1     1
180    WORK   16.60   16.70   16.50    1     1     0

[181 rows x 7 columns]

In [15]:
consensus.query('buy + hold + sell == 0')

       name  target    max    min  buy  hold  sell
12      ASP    3.00   3.00   3.00    0     0     0
25   BEAUTY    0.50   0.50   0.50    0     0     0
43    COTTO    2.24   2.24   2.24    0     0     0
51      DCC    2.24   2.55   2.06    0     0     0
69   GVREIT    6.60   6.60   6.60    0     0     0
93    LANNA   14.90  14.90  14.90    0     0     0
100     MCS    8.30   8.30   8.30    0     0     0
103     MST   10.00  10.00  10.00    0     0     0
122     RCL   18.00  18.00  18.00    0     0     0
123     RJH   32.00  33.00  31.00    0     0     0
134    SENA    2.27   2.27   2.27    0     0     0
135  SINGER    6.00   6.00   6.00    0     0     0
141     SNC    9.20   9.90   8.50    0     0     0
143    SPCG   15.80  15.80  15.80    0     0     0
149    STGT    7.50   7.50   7.50    0     0     0
157     THG   51.25  56.00  47.00    0     0     0
161     TKS    8.95   8.95   8.95    0     0     0

In [16]:
stock_name = 'SENA'
consensus.query('name == @stock_name')

     name  target   max   min  buy  hold  sell
134  SENA    2.27  2.27  2.27    0     0     0

In [17]:
prf_css = pd.merge(my_profits, consensus, on='name', how='inner')
prf_css.shape

(21, 8)

In [18]:
prf_css.buy.value_counts(normalize=True).to_frame().style.format('{:.2%}')

### Profits w/o consensus

In [19]:
df_merge = pd.merge(my_profits, consensus, on='name', how='outer',indicator=True)
prf_wo_css = df_merge['_merge'] == 'left_only'
df_merge[prf_wo_css]

Empty DataFrame
Columns: [name, market, target, max, min, buy, hold, sell, _merge]
Index: []

In [20]:
names = df_merge[prf_wo_css]['name']
names

Series([], Name: name, dtype: object)

In [21]:
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

''

In [22]:
sqlDel = """
DELETE FROM profits
WHERE name in (%s)"""
sqlDel = sqlDel % in_p
print(sqlDel)

DELETE FROM profits
WHERE name in ()

In [23]:
#rp = conmy.execute(sqlDel)
#rp.rowcount

NameError: name 'rp' is not defined

### Matching check with Buy table in MySql database to filter only records not yet in stocks

In [24]:
sql = """
SELECT name
FROM buy
WHERE active = 1"""
buy_df = pd.read_sql(sql, const)
buy_df.shape

(30, 1)

In [25]:
final_buy = pd.merge(my_profits, buy_df, on='name', how='outer', indicator=True)
final_buy

       name                      market      _merge
0    AIMIRT                         SET        both
1       BBL     SET50 / SETHD / SETTHSI   left_only
2       BEM     SET50 / SETTHSI / SETWB   left_only
3        BH     SET50 / SETCLMV / SETWB   left_only
4        CK  SET100 / SETCLMV / SETTHSI   left_only
..      ...                         ...         ...
43      AWC                         NaN  right_only
44    SYNEX                         NaN  right_only
45      SCC                         NaN  right_only
46      RCL                         NaN  right_only
47  CPNREIT                         NaN  right_only

[48 rows x 3 columns]

In [26]:
final_buy.rename(columns={'_merge':'merge_1'},inplace=True)
final_buy

       name                      market     merge_1
0    AIMIRT                         SET        both
1       BBL     SET50 / SETHD / SETTHSI   left_only
2       BEM     SET50 / SETTHSI / SETWB   left_only
3        BH     SET50 / SETCLMV / SETWB   left_only
4        CK  SET100 / SETCLMV / SETTHSI   left_only
..      ...                         ...         ...
43      AWC                         NaN  right_only
44    SYNEX                         NaN  right_only
45      SCC                         NaN  right_only
46      RCL                         NaN  right_only
47  CPNREIT                         NaN  right_only

[48 rows x 3 columns]

In [27]:
sql = """
SELECT name 
FROM stocks
ORDER BY name"""
lite_stocks = pd.read_sql(sql, conlite)
lite_stocks.shape

(48, 1)

In [28]:
df_merge = pd.merge(lite_stocks, final_buy, on='name', how='outer', indicator=True)
df_merge

      name                   market     merge_1 _merge
0       AH                      NaN  right_only   both
1   AIMIRT                      SET        both   both
2      ASK                      NaN  right_only   both
3      ASP                      NaN  right_only   both
4      AWC                      NaN  right_only   both
..     ...                      ...         ...    ...
43     TMT                      NaN  right_only   both
44     TOA                  SETTHSI        both   both
45     TTB  SET50 / SETHD / SETTHSI   left_only   both
46   WHAIR                      NaN  right_only   both
47   WHART                      NaN  right_only   both

[48 rows x 4 columns]

In [29]:
not_in_final_buy = df_merge.loc[
    df_merge['_merge'] == 'left_only']
not_in_final_buy

Empty DataFrame
Columns: [name, market, merge_1, _merge]
Index: []

In [30]:
names = not_in_final_buy['name']
names

Series([], Name: name, dtype: object)

In [31]:
names = not_in_final_buy['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

''

In [32]:
sqlDel = """
DELETE FROM stocks
WHERE name IN (%s)"""
sqlDel = sqlDel % in_p
print(sqlDel)
rp = conlite.execute(sqlDel)
rp.rowcount

DELETE FROM stocks
WHERE name IN ()

0

In [33]:
not_in_port = final_buy.loc[
    final_buy['merge_1'] == 'left_only']
not_in_port

     name                             market    merge_1
1     BBL            SET50 / SETHD / SETTHSI  left_only
2     BEM            SET50 / SETTHSI / SETWB  left_only
3      BH            SET50 / SETCLMV / SETWB  left_only
4      CK         SET100 / SETCLMV / SETTHSI  left_only
5     CPN                    SET50 / SETTHSI  left_only
6   DELTA                                SET  left_only
7    HANA                   SET100 / SETTHSI  left_only
8    ICHI                     sSET / SETCLMV  left_only
9     III                               sSET  left_only
11    KTB            SET50 / SETHD / SETTHSI  left_only
12      M                              SETWB  left_only
13    PSH                            SETTHSI  left_only
14  PTTEP  SET50 / SETCLMV / SETHD / SETTHSI  left_only
15     QH                     SET100 / SETHD  left_only
16  SAPPE                               sSET  left_only
17     SC                     sSET / SETTHSI  left_only
18   SIRI                      SET / SETTHSI  left_only
20    TTB            SET50 / SETHD / SETTHSI  left_only

In [34]:
file_name = 'consensus-ORD.csv'
data_file = data_path + file_name
output_file = csv_path + file_name
osd_file = osd_path + file_name
one_file = one_path + file_name

not_in_port.sort_values(['name'],ascending=[True]).to_csv(output_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(data_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(osd_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(one_file, index=False)

### Process to combine profits and in-port records

In [35]:
sql = '''
SELECT P.name, 'O' AS sts
FROM profits P
ORDER BY P.name'''
df_prf = pd.read_sql(sql, conmy)
df_prf

      name sts
0   AIMIRT   O
1      BBL   O
2      BEM   O
3       BH   O
4       CK   O
5      CPN   O
6    DELTA   O
7     HANA   O
8     ICHI   O
9      III   O
10     JMT   O
11     KTB   O
12       M   O
13     PSH   O
14   PTTEP   O
15      QH   O
16   SAPPE   O
17      SC   O
18    SIRI   O
19     TOA   O
20     TTB   O

In [36]:
sql = '''
SELECT name, 'I' AS sts
FROM buy
ORDER BY name'''
df_buy= pd.read_sql(sql, const)
df_buy

       name sts
0        AH   I
1    AIMIRT   I
2       ASK   I
3       ASP   I
4       AWC   I
5       BCH   I
6   CPNREIT   I
7       DIF   I
8    GVREIT   I
9       IVL   I
10    JASIF   I
11    JMART   I
12      JMT   I
13      KCE   I
14      MCS   I
15      NER   I
16      ORI   I
17      PTG   I
18    PTTGC   I
19      RCL   I
20      SCC   I
21     SENA   I
22   SINGER   I
23      STA   I
24    SYNEX   I
25    TFFIF   I
26      TMT   I
27      TOA   I
28    WHAIR   I
29    WHART   I

In [37]:
df_ttl = df_buy.append(df_prf)
df_ttl

      name sts
0       AH   I
1   AIMIRT   I
2      ASK   I
3      ASP   I
4      AWC   I
..     ...  ..
16   SAPPE   O
17      SC   O
18    SIRI   O
19     TOA   O
20     TTB   O

[51 rows x 2 columns]

In [38]:
duplicates_in_name = df_ttl[df_ttl['name'].duplicated(keep=False)]

duplicates_in_name

      name sts
1   AIMIRT   I
12     JMT   I
27     TOA   I
0   AIMIRT   O
10     JMT   O
19     TOA   O

In [39]:
df_unique = df_ttl.drop_duplicates(subset='name', keep='first')
df_unique

      name sts
0       AH   I
1   AIMIRT   I
2      ASK   I
3      ASP   I
4      AWC   I
..     ...  ..
15      QH   O
16   SAPPE   O
17      SC   O
18    SIRI   O
20     TTB   O

[48 rows x 2 columns]

In [40]:
names = df_unique['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'AH', 'AIMIRT', 'ASK', 'ASP', 'AWC', 'BCH', 'CPNREIT', 'DIF', 'GVREIT', 'IVL', 'JASIF', 'JMART', 'JMT', 'KCE', 'MCS', 'NER', 'ORI', 'PTG', 'PTTGC', 'RCL', 'SCC', 'SENA', 'SINGER', 'STA', 'SYNEX', 'TFFIF', 'TMT', 'TOA', 'WHAIR', 'WHART', 'BBL', 'BEM', 'BH', 'CK', 'CPN', 'DELTA', 'HANA', 'ICHI', 'III', 'KTB', 'M', 'PSH', 'PTTEP', 'QH', 'SAPPE', 'SC', 'SIRI', 'TTB'"

In [41]:
type(in_p)

str

In [42]:
sql = """
SELECT name 
FROM stocks
WHERE name NOT IN (%s)
"""
sql = sql % in_p
excess_stocks = pd.read_sql(sql, conlite)
excess_stocks

Empty DataFrame
Columns: [name]
Index: []

In [43]:
sql = """
SELECT name, status
FROM stocks
WHERE name  IN (%s)
ORDER BY name
"""
sql = sql % in_p
in_port_on_watch = pd.read_sql(sql, conlite)
in_port_on_watch

      name status
0       AH      I
1   AIMIRT      I
2      ASK      B
3      ASP      I
4      AWC      I
..     ...    ...
43     TMT      B
44     TOA      I
45     TTB      O
46   WHAIR      B
47   WHART      B

[48 rows x 2 columns]

In [44]:
in_port_on_watch.query('status == "T"')

Empty DataFrame
Columns: [name, status]
Index: []

In [45]:
sql = """
SELECT name, status FROM stocks ORDER BY name"""
df_stocks = pd.read_sql(sql, conlite)
df_stocks

      name status
0       AH      I
1   AIMIRT      I
2      ASK      B
3      ASP      I
4      AWC      I
..     ...    ...
43     TMT      B
44     TOA      I
45     TTB      O
46   WHAIR      B
47   WHART      B

[48 rows x 2 columns]

In [46]:
type(in_p)

str

In [47]:
names_list = set(names)
names_in_df = set(df_stocks['name'])

missing_names = names_list - names_in_df
missing_names

set()

In [48]:
type(missing_names)

set

In [49]:
# Convert set to desired string format
formatted_str = ', '.join(f"'{item}'" for item in missing_names)
formatted_str

''

In [50]:
# Convert formatted string back to a list
names_list = [name.strip().strip("'") for name in formatted_str.split(",")]
names_list

['']

In [51]:
# Convert list to DataFrame
df = pd.DataFrame(names_list, columns=['name'])
df

  name
0